import numpy as np
from osgeo import gdal
LOWVEGE = ["0110", "0140", "0170", "0180", "0370", "0380", "0391", "0392", "0393", "03A1", "03A2", "03A3", "03A4", "03A9"]
HIGHVEGE = ["0131", "0132", "0133", "0311", "0312", "0313", "0321", "0322", "0323", "0330", "0340", "0350", "0360"]

# 16 classes
水田 = ['0101','0102']
旱地 = ['0103']
果园 = ['0201', '0201K']
茶园 = ['0202', '0202K']
乔木林地 = ['0301','0301K','0302','0302K']
灌木林地 = ['0305']
苗圃 = ['0307', '0307K',"0302", "0302K"]
草地 = ['0401','0403','0404','0403K']
工矿用地 = ['0601', '0602']
公共建筑 = ['05H1','0508','08H1','08H2','0809', '08H2A',]
城镇住宅 = ['0701']
农村住宅 = ['0702']
公路用地 = ['1003']
农村道路 = ['1006']
河流 = ['1101', '1107', '1107A', '1103']
裸地 = ['1201','1202','1203','1204','1205','1206','1207']

# 6 classes
田地 = 水田 + 旱地
园地 = 果园 + 茶园
林地 = 乔木林地 + 灌木林地 + 苗圃
建筑用地 = 公共建筑 + 城镇住宅 + 农村住宅
道路 = 公路用地 + 农村道路
水体 = 河流


CORRESPOND = {
"0303": "红树林地",
"0304": "森林沼泽",
"0306": "灌丛沼泽",
"0402": "沼泽草地",
"0603": "盐田",
"1105": "沿海滩涂",
"1106": "内陆滩涂",
"1108": "沼泽地",
"0101": "水田",
"0102": "水浇地",
"0103": "旱地",
"0201": "果园",
"0201K": "果园",
"0202": "茶园",
"0202K": "茶园",
"0203": "橡胶园",
"0203K": "橡胶园",
"0204": "其他园地",
"0204K": "其他园地",
"0301": "乔木林地",
"0301K": "乔木林地",
"0302": "竹林地",
"0302K": "竹林地",
"0305": "灌木林地",
"0307": "其他林地",
"0307K": "其他林地",
"0401": "天然牧草地",
"0403": "人工牧草地",
"0403K": "人工牧草地",
"0404": "其他草地",
"05H1": "商业服务业设施用地",
"0508": "物流仓储用地",
"0601": "工业用地",
"0602": "采矿用地",
"0701": "城镇住宅用地",
"0702": "农村宅基地",
"08H1": "机关团体新闻出版用地",
"08H2": "科教文卫用地",
"08H2A": "科教文卫用地",
"0809": "公用设施用地",
"0810": "公园与绿地",
"0810A": "公园与绿地",
"1001": "铁路用地",
"1002": "轨道交通用地",
"1003": "公路用地",
"1004": "城镇村道路用地",
"1005": "交通服务场站用地",
"1006": "农村道路",
"1007": "机场用地",
"1008": "港口码头用地",
"1009": "管道运输用地",
"1101": "河流水面",
"1102": "湖泊水面",
"1103": "水库水面",
"1104": "坑塘水面",
"1104A": "坑塘水面",
"1107": "沟渠",
"1107A": "沟渠",
"1109": "水工建筑用地",
"1110": "冰川及永久积雪",
"1201": "空闲地",
"1202": "设施农用地",
"1203": "田坎",
"1204": "盐碱地",
"1205": "沙地",
"1206": "裸土地",
"1207": "裸岩石砾地",
"09": "其他建筑"
}

CORRESPOND_LABEL = {
    "红树林地": 0,
    "森林沼泽": 1,
    "灌丛沼泽": 2,
    "沼泽草地": 3,
    "盐田": 4,
    "沿海滩涂": 5,
    "内陆滩涂": 6,
    "沼泽地": 7,
    "水田": 8,
    "水浇地": 9,
    "旱地": 10,
    "果园": 11,
    "茶园": 12,
    "橡胶园": 13,
    "其他园地": 14,
    "乔木林地": 15,
    "竹林地": 16,
    "灌木林地": 17,
    "其他林地": 18,
    "天然牧草地": 19,
    "人工牧草地": 20,
    "其他草地": 21,
    "商业服务业设施用地": 22,
    "物流仓储用地": 23,
    "工业用地": 24,
    "采矿用地": 25,
    "城镇住宅用地": 26,
    "农村宅基地": 27,
    "机关团体新闻出版用地": 28,
    "科教文卫用地": 29,
    "公用设施用地": 30,
    "公园与绿地": 31,
    "铁路用地": 32,
    "轨道交通用地": 33,
    "公路用地": 34,
    "城镇村道路用地": 35,
    "交通服务场站用地": 36,
    "农村道路": 37,
    "机场用地": 38,
    "港口码头用地": 39,
    "管道运输用地": 40,
    "河流水面": 41,
    "湖泊水面": 42,
    "水库水面": 43,
    "坑塘水面": 44,
    "沟渠": 45,
    "水工建筑用地": 46,
    "冰川及永久积雪": 47,
    "空闲地": 48,
    "设施农用地": 49,
    "田坎": 50,
    "盐碱地": 51,
    "沙地": 52,
    "裸土地": 53,
    "裸岩石砾地": 54,
    "其他建筑": 55
}
def get_colormap():
    tb = gdal.ColorTable()
    tb.SetColorEntry(0, (42, 130, 127))
    tb.SetColorEntry(1, (109, 119, 39, 255))
    tb.SetColorEntry(2, (160, 12, 153, 255))
    tb.SetColorEntry(3, (217, 217, 217, 255))
    tb.SetColorEntry(4, (12, 113, 6, 255))
    tb.SetColorEntry(5, (127, 228, 121, 255))
    tb.SetColorEntry(6, (226, 240, 217, 255))
    
    tb.SetColorEntry(7, (0, 255, 0, 255))
    tb.SetColorEntry(8, (218, 242, 0, 255))
    tb.SetColorEntry(9, (255, 0, 0, 255))
    # tb.SetColorEntry(10, (244, 177, 131, 255))
    tb.SetColorEntry(10, (255, 210, 10, 255))
    tb.SetColorEntry(11, (242, 121, 0, 255))
    
    tb.SetColorEntry(12, (156, 65, 0, 255))
    tb.SetColorEntry(13, (92, 64, 64, 255))
    tb.SetColorEntry(14, (63, 186, 252, 255))
    # tb.SetColorEntry(16, (0, 0, 255, 255))
    tb.SetColorEntry(15, (255, 255, 0, 255))
    tb.SetColorEntry(16, (0, 0, 0, 255))
    return tb

def get_guiyang_labelmap(): # TODO: 改变规则
    labelmap = np.zeros((4,1), dtype=np.uint8)
    labelmap[0] = 0
    return labelmap